zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/include/stm32mp13xx_ll_adc.h
/* Private macros ------------------------------------------------------------*/
/** @defgroup ADC_LL_Private_Macros ADC Private Macros
  * @{
  */

/**
  * @brief  Driver macro reserved for internal use: set a pointer to
  *         a register from a register basis from which an offset
  *         is applied.
  * @param  __REG__ Register basis from which the offset is applied.
  * @param  __REG_OFFFSET__ Offset to be applied (unit: number of registers).
  * @retval Pointer to register address
  */
#define __ADC_PTR_REG_OFFSET(__REG__, __REG_OFFFSET__)                         \
  ((__IO uint32_t *)((uint32_t) ((uint32_t)(&(__REG__)) + ((__REG_OFFFSET__) << 2UL))))

/**
  * @}
  */


/* Exported types ------------------------------------------------------------*/
#if defined(USE_FULL_LL_DRIVER)
/** @defgroup ADC_LL_ES_INIT ADC Exported Init structure
  * @{
  */

/**
  * @brief  Structure definition of some features of ADC common parameters
  *         and multimode
  *         (all ADC instances belonging to the same ADC common instance).
  * @note   The setting of these parameters by function @ref LL_ADC_CommonInit()
  *         is conditioned to ADC instances state (all ADC instances
  *         sharing the same ADC common instance):
  *         All ADC instances sharing the same ADC common instance must be
  *         disabled.
  */
typedef struct
{
  uint32_t CommonClock;/*!< Set parameter common to several ADC: Clock source and prescaler.
                           This parameter can be a value of @ref ADC_LL_EC_COMMON_CLOCK_SOURCE
                           @note On this STM32 seriess, if ADC group injected is used, some
                                 clock ratio constraints between ADC clock and AHB clock
                                 must be respected. Refer to reference manual.
                           This feature can be modified afterwards using unitary
                           function @ref LL_ADC_SetCommonClock(). */


} LL_ADC_CommonInitTypeDef;

/**
  * @brief  Structure definition of some features of ADC instance.
  * @note   These parameters have an impact on ADC scope: ADC instance.
  *         Affects both group regular and group injected (availability
  *         of ADC group injected depends on STM32 families).
  *         Refer to corresponding unitary functions into
  *         @ref ADC_LL_EF_Configuration_ADC_Instance .
  * @note   The setting of these parameters by function @ref LL_ADC_Init()
  *         is conditioned to ADC state:
  *         ADC instance must be disabled.
  *         This condition is applied to all ADC features, for efficiency
  *         and compatibility over all STM32 families. However, the different
  *         features can be set under different ADC state conditions
  *         (setting possible with ADC enabled without conversion on going,
  *         ADC enabled with conversion on going, ...)
  *         Each feature can be updated afterwards with a unitary function
  *         and potentially with ADC in a different state than disabled,
  *         refer to description of each function for setting
  *         conditioned to ADC state.
  */
typedef struct
{
  uint32_t Resolution;                  /*!< Set ADC resolution.
                                             This parameter can be a value of @ref ADC_LL_EC_RESOLUTION

                                             This feature can be modified afterwards using unitary
                                             function @ref LL_ADC_SetResolution(). */

  uint32_t LowPowerMode;                /*!< Set ADC low power mode.
                                             This parameter can be a value of @ref ADC_LL_EC_LP_MODE

                                             This feature can be modified afterwards using
                                             unitary function @ref LL_ADC_SetLowPowerMode(). */

} LL_ADC_InitTypeDef;

/**
  * @brief  Structure definition of some features of ADC group regular.
  * @note   These parameters have an impact on ADC scope: ADC group regular.
  *         Refer to corresponding unitary functions into
  *         @ref ADC_LL_EF_Configuration_ADC_Group_Regular
  *         (functions with prefix "REG").
  * @note   The setting of these parameters by function @ref LL_ADC_REG_Init()
  *         is conditioned to ADC state:
  *         ADC instance must be disabled.
  *         This condition is applied to all ADC features, for efficiency
  *         and compatibility over all STM32 families. However, the different
  *         features can be set under different ADC state conditions
  *         (setting possible with ADC enabled without conversion on going,
  *         ADC enabled with conversion on going, ...)
  *         Each feature can be updated afterwards with a unitary function
  *         and potentially with ADC in a different state than disabled,
  *         refer to description of each function for setting
  *         conditioned to ADC state.
  */
typedef struct
{
  uint32_t TriggerSource;    /*!< Set ADC group regular conversion trigger source: internal (SW start) or from external peripheral (timer event, external interrupt line).
                                  This parameter can be a value of @ref ADC_LL_EC_REG_TRIGGER_SOURCE
                                  @note On this STM32 seriess, setting trigger source to external
                                  trigger also set trigger polarity to rising edge
                                  (default setting for compatibility with some ADC on other STM32
                                  families having this setting set by HW default value).
                                  In case of need to modify trigger edge, use function @ref LL_ADC_REG_SetTriggerEdge().

                                  This feature can be modified afterwards using unitary
                                  function @ref LL_ADC_REG_SetTriggerSource(). */

  uint32_t SequencerLength;  /*!< Set ADC group regular sequencer length.
                                  This parameter can be a value of @ref ADC_LL_EC_REG_SEQ_SCAN_LENGTH

                                  This feature can be modified afterwards using unitary
                                  function @ref LL_ADC_REG_SetSequencerLength(). */

  uint32_t SequencerDiscont; /*!< Set ADC group regular sequencer discontinuous mode: sequence subdivided and scan conversions interrupted every selected number of ranks.
                                  This parameter can be a value of @ref ADC_LL_EC_REG_SEQ_DISCONT_MODE
                                  @note This parameter has an effect only if group regular sequencer is enabled
                                        (scan length of 2 ranks or more).

                                  This feature can be modified afterwards using unitary
                                  function @ref LL_ADC_REG_SetSequencerDiscont(). */

  uint32_t ContinuousMode;   /*!< Set ADC continuous conversion mode on ADC group regular, whether ADC conversions are performed in single mode (one conversion per trigger) or in continuous mode (after the first trigger, following conversions launched successively automatically).
                                  This parameter can be a value of @ref ADC_LL_EC_REG_CONTINUOUS_MODE
                                  Note: It is not possible to enable both ADC group regular
                                        continuous mode and discontinuous mode.

                                  This feature can be modified afterwards using unitary
                                  function @ref LL_ADC_REG_SetContinuousMode(). */

  uint32_t DataTransferMode;            /*!< Set ADC group regular conversion data transfer mode: no transfer, transfer by DMA (Limited/Unlimited) or DFSDM.*/
  /*   This parameter can be a value of @ref ADC_LL_EC_REG_DMA_TRANSFER_MODE

       This feature can be modified afterwards using unitary function @ref LL_ADC_REG_SetDMATransferMode(). */

